// Дані відгуків. Кожен відгук має: нік, аватар (посилання), текст, рейтинг (1-5).
// Щоб додати новий відгук - скопіюй шаблон і заповни дані.

const reviewsData = [

  {
    nick: "Zoomsos123",
    avatar: "https://i.postimg.cc/Y0QgBgcx/image-(3).webp",
    text: "Це найкраща спільнота, в якій я коли-небудь був! Всі дуже дружні та допомагають один одному. Рекомендую всім приєднатися!",
    rating: 5,
    date: "19.08.2026"
  },
  {
    nick: "Caston08963",
    avatar: "https://i.postimg.cc/HL9rQGz1/image.webp",
    text: "Мені сподобався цей сервер. Він дуже крутий, добре оптимізований і має чудово пропрацьовані правила для RP. Колектив і гравці класні, з ними приємно спілкуватися",
    rating: 5,
    date: "19.09.2026"
  },
  {
    nick: "KILLER_00803",
    avatar: "https://i.postimg.cc/ryY1bmxY/image-(5).webp",
    text: "Це найкращий RP-сервер, який я бачив! Після того як я потрапив на цей проєкт, я розслабився! Тут усе зрозуміло, просто дуже відповідальний власник і відповідальна влада. Це обовʼязково 5 зірок, без питань! Дякую власнику за такий реалістичний сервер. Хотів би я йому потиснути руку!!",
    rating: 5,
    date: "20.08.2026"
  },
];