const rulesData = [
  {
    number: 1,
    title: "Норми поведінки та взаємоповага",
    articles: [
      {
        title: "Стаття 1.1. Статус громадянина",
        text: "Кожний гравець є повноціним RP - громадянином сервера. Гравець зобов'язаний дотримуватися правил сервера, а також не знання правил сервера не звільняє від відповідальності за їх порушення. \n\n Правила сервера не передбачають усіх випадків порушення вони є базовою основою для забезпечення справедливості та порядку на сервері. У разі виникнення ситуацій, не передбачених правилами, адміністрація має право приймати рішення на власний розсуд. Якщо ви хочете оскаржити рішення адміністрації звертайтеся до власника сервера.",
        punishment: "Бан на 1 день"
      },
      {
        title: "Стаття 1.2. Повага до гравців",
        text: "Кожен гравець зобов'язаний поважати інших учасників сервера. Забороняється принижувати, цькувати (булити), дискримінувати, провокувати або проявляти неповагу до окремого гравця чи групи гравців.",
        punishment: "Попередження або штраф 8000€."
      },
      {
        title: "Стаття 1.3. Використання Voice Chat",
        text: "Забороняється вмикати гучну музику, сторонні звуки, пропагандистський контент, російську музику в будь - якому вигляді (виняток — російськомовні пісні українських виконавців із проукраїнською позицією).",
        punishment: "Попередження або штраф 8000€."
      },
    ]
  },
  {
    number: 2,
    title: "Зовнішній вигляд",
    articles: [
      {
        title: "Стаття 2.1. Ігровий нікнейм",
        text: "Гравець зобов'язаний використовувати коректний та читабельний нікнейм. Забороняється використовувати нікнейми, що містять нецензурну лексику, образи, провокації, надмірну кількість спеціальних символів або інший неприйнятний вміст.",
        punishment: "На розсуд адміністрації."
      },
      {
        title: "Стаття 2.2. Ігровий аватар",
        text: "Гравець зобов'язаний використовувати аватар, який не надає ігрової переваги. Забороняється використовувати надто великі або надто малі аватари, що змінюють стандартні хітбокси персонажа..",
        punishment: "Бан до 3 днів."
      },
      {
        title: "Стаття 2.3. Заборонені аватари",
        text: "Забороняється використовувати аватари, що містять або пропагують заборонену символіку, екстремістські ідеології, державу - агресора, терористичні організації, нацистську символіку або інший провокаційний контент. Українська символіка дозволяється.",
        punishment: "Бан від 2 днів до перманентного блокування акаунта."
      }
    ]
  },

  {
    number: 3,
    title: "Порушення RP - процесу",
    articles: [
      {
        title: "Стаття 3.1. Нон-RP поведінка",
        text: "Забороняється виконувати дії, що суперечать логіці та реалістичності RP - процесу. Будь - які вчинки, які не відповідають ролі персонажа або поточній RP-ситуації, вважаються нон-RP поведінкою.",
        punishment: "Попередження або бан від 2 до 5 днів — залежно від тяжкості."
      },
      {
        title: "Стаття 3.2. Рейди та масові вбивства",
        text: "Забороняється організовувати або участвувати у рейдах та масових вбивствах, які порушують правила RP.",
        punishment: "Бан назавжди."
      },
      {
        title: "Стаття 3.3. Відігрування RP-команд.",
        text: "Кожний гравець зобов'язаний дотримуватися RP-команд та правильно відігрувати свого персонажа.\n\n /me - команда для опису дій вашого персонажа, які неможливо побачити через ігрові механіки.\n\n /do - команда для опису стану персонажа, предметів або подій, які може побачити ваш персонаж.\n\n /d - Non-RP чат, який використовується для спілкування поза межами RP.",
        punishment: "попередження або бан від 1 до 4 днів."
      },
      {
        title: "Стаття 4.4. Види порушень RP (примітка)",
        text: "OOC — спілкування поза роллю.\n\n MG — використання позаігрової інформації.\n\n PG — нереалістичні дії.\n\nRDM — безпричинне вбивство.\n\n SK — вбивство одразу після спавну.\n\n NVL — ігнорування цінності життя.\n\n Breaking RP — вихід із ролі.\n\n RK — помста без RP-підстав.\n\n BunnyHop — нереалістичні стрибки.\n\n Cuff Rush — наручники без підстав.\n\n Combat Logging — вихід з гри під час RP.\n\n FailRP — грубе порушення RP-логіки.\n\n Exploiting — використання багів. Cheating — читерство.", 
        punishment: "-" 
      }
    ]
  },
  {
    number: 4,
    title: "Правила дорожнього руху (ПДР)",
    articles: [
      {
        title: "Стаття 4.1. Неправильне паркування",
        text: "Забороняється залишати транспортний засіб у місцях, не призначених для паркування: посеред дороги, на пішохідних переходах, перехрестях тощо.",
        punishment: "Штраф 3000€ або кік."
      },
      {
        title: "Стаття 4.2. Необережне керування транспортом",
        text: "Забороняється необережне керування транспортним засобом, яке може створити аварійну ситуацію або призвести до дорожньо-транспортної пригоди (ДТП). До таких порушень належать небезпечні маневри, дрифт у громадських місцях, рух зустрічною смугою без RP-причини, навмисне блокування дорожнього руху, ігнорування дорожньої обстановки та інші дії, що свідчать про неуважність або недбалість водія.",
        punishment: "Штраф 4000€"
      },
     {
        title: "Стаття 4.3. Ввімкнення фар на транспорті",
        text: "Кожний гравець забов'язаний умівкнути фари з 18:00 до 06:00, а також у разі поганої видимості (туман, дощ тощо).",
        punishment: "Штраф 2000€"
      },
      {
        title: "Стаття 4.4. Перевага для екстрених служб",
        text: "Усі учасники дорожнього руху зобов'язані надавати перевагу транспортним засобам екстрених служб з увімкненими маячками чи сигналами. Блокування проїзду забороняється.",
        punishment: "Штраф 4000€"
      }
    ]
  },
  {
    number: 5,
    title: "Шахрайство та безпека",
    articles: [
      {
        title: "Стаття 5.1. Шахрайство, обман, байтинг та дезінформація",
        text: "Забороняється обманювати інших гравців, видавати себе за правохоронця чи за іншу особу на сервері, проводити фальшиві угоди, фінансові махінації, поширювати неправдиву інформацію. Заборонені неправдиві виклики екстрених служб.",
        punishment: "Штраф від 8000€ до 15000€ або бан до 4 днів (залежно від тяжкості порушенння)."
      },
      {
        title: "Стаття 5.2. Поширення персональних даних, шантаж та погрози",
        text: "Забороняється поширювати персональні дані інших осіб без їхньої згоди, здійснювати шантаж, погрожувати, вимагати конфіденційну інформацію або будь-яким способом порушувати безпеку та приватність гравців.\n\n Також забороняється видавати себе за адміністратора, працівника державного органу чи іншу особу з метою введення гравців в оману або отримання будь-якої вигоди.",
        punishment: "Бан на 30 днів, а також бан у групі сервера на 30 днів."
      }
    ]
  },
  {
    number: 6,
    title: "Використання зброї",
    articles: [
      {
        title: "Стаття 6.1. Не правомірне використання зброї",
        text: "Забороняється використовувати зброю без законних підстав, а також застосовувати її проти інших гравців без обґрунтованої RP-причини.",
        punishment: "Штраф 5000€"
      },
      {
        title: "Стаття 6.2. Носіння зброї в громадських місцях",
        text: "Забороняється відкрито носити або демонструвати зброю в громадських місцях без законних підстав",
        punishment: "Штраф 6000€"
      },

    ]
  },
  {
    number: 7,
    title: "Злочине угропування та кримінальна діяльність",
    articles: [
    {
      title: "Стаття 7.1. Злочинні угрупування",
      text: "Злочинним угрупуванням вважається організована група гравців, яка спільно займається кримінальною діяльністю.\n\nМаксимальна кількість учасників одного злочинного угрупування - 25 осіб.\n\nУчасники угрупування зобов'язані дотримуватися правил сервера та не використовувати кримінальну діяльність для безпричинного створення конфліктів.\n\n Офіційно злочине угрупування можна створити лише з довзволу власника сервера.",
      punishment: "Бан до 3 днів та розформування угрупування."
    },
    {
      title: "Стаття 7.2. Кримінальні ситуації",
      text: "Під час одного пограбування, захоплення, викрадення або іншої кримінальної ситуації дозволяється брати участь не більше 8 членам одного угрупування.\n\nЗабороняється обходити ліміт учасників шляхом залучення інших угрупувань або сторонніх гравців.\n\nКримінальна ситуація повинна мати обґрунтовану RP-причину. Забороняється безпричинно нападати, викрадати інших гравців.",
      punishment: "Бан до 2 днів "
    },
    
    {
      title: "Стаття 7.3. Заручники та захоплення",
      text: "Захоплення та взяття заручників повинно мати обґрунтовану RP-причину.\n\nМаксимальна кількість заручників під час однієї ситуації - 4 особи.\n\nЗабороняється безпідставно утримувати заручників, брати друзів або інших гравців за попередньою домовленістю, а також використовувати заручників виключно для провокації правоохоронців.\n\nПід час захоплення дозволяється брати участь не більше 10 членам угрупування.",
      punishment: "Попередження або штраф 6000€."
    }

    ]
  },

  {
    number: 8,
    title: "Правохороні органи",
    articles: [
      {
        title: "Стаття 8.1. Дотримання правил для правоохоронців",
        text: "Працівники правоохоронних органів зобов'язані дотримуватися правил сервера, а також правил, встановлених для їхніх посад та обов'язків.\n\nЗабороняється перевищувати службові повноваження, здійснювати незаконні арешти або накладати безпідставні штрафи, неправомірно використовувати шипи.\n\nТакож забороняється безпідставне використання зброї, тазера, гранат або GPS-трекера, а також арешт та ув'язнення гравців, які мають ліцензію на зброю, без законних підстав.\n\nЗабороняється зловживати службовим становищем або порушувати права громадян.",
        punishment: "Попередження, Бан до 5 днів, залежно від тяжкості порушення."
      },
      {
        title: "Стаття 8.2. Мовні вимоги для правоохоронців",
        text: "Працівники правоохоронних органів зобов'язані під час виконанні службових обов'язків розмовляти українською мовобою.",
        punishment: "Штраф 6000€"
      },


    ]
  },
  {
    number: 9,
    title: "Корупція",
    articles: [
      {
        title: "Стаття 9.1. Хабарництво та посередництво у корупції",
        text: "Забороняється приймати, пропонувати або вимагати хабарі, а також виступати посередником під час їх передачі чи допомагати в ухиленні від відповідальності за корупційні дії. До корупційних правопорушень також належать незаконне використання службового становища, надання незаконних переваг окремим особам та будь-які інші дії, що суперечать принципам чесної державної служби.",
        punishment: "Тюремне покарання (IC)."
      },
      {
        title: "Стаття 9.2. Приховування корупції",
        text: "Забороняється приховувати факти корупції, сприяти їх приховуванню або умисно не повідомляти про відомі випадки корупції у фракціях. Якщо гравцю стало відомо про корупційні дії, він зобов'язаний повідомити про це ДБР або власника сервера.",
        punishment: "Тюремне покарання (IC)."
      }
    ]
  },
  {
    number: 10,
    title: "Бізнеси",
    articles: [
      {
        title: "Стаття 10.1. Відкриття бізнесу",
        text: "Кожен бізнес може бути відкритий лише після погодження з власником сервера.",
        punishment: "Бан до 3 днів."
      },
      {
        title: "Стаття 10.2. Діяльність бізнесу",
        text: "Бізнес зобов'язаний дотримуватися правил сервера. Якщо діяльність систематично порушує правила — адміністрація має право призупинити або закрити його.",
        punishment: "Тимчасове призупинення або закриття бізнесу."
      },
      {
        title: "Стаття 10.3. Відповідальність власника бізнесу",
        text: "Власник бізнесу несе відповідальність за дії працівників під час виконання службових обов'язків.",
        punishment: "Призупинення діяльності або закриття бізнесу."
      },
      {
        title: "Стаття 10.4. Використання бізнесу для порушення правил",
        text: "Забороняється використовувати бізнес для шахрайства, відмивання коштів, обходу правил сервера, тощо.",
        punishment: "Закриття бізнесу, а також бан від 3 до 14 днів."
      }
    ]
  },
  {
    number: 11,
    title: "Зелені зони",
    articles: [
      {
        title: "Стаття 11.1. Зелені зони",
        text: "До зелених зон належать: Лікарня, Пожежна частини, Парки, Поліцейське віділення. Заборонено використовувати та показувати зброю, погрожувати, вчиняти злочини.",
        punishment: "Кік або бан до 4 днів.",
      },
      {
        title: "Стаття 11.2. Перебування в зеленій зоні з розшуком",
        text: "Забороняється перебувати в зелених зонах з активним розшуком більше 2 хвилин. Виняток — якщо гравець під арештом чи доставлений правоохоронцями.",
        punishment: "Кік або бан до 2 днів."
      }
    ]
  },
  {
    number: 12,
    title: "Судова влада",
    articles: [
      {
        title: "Стаття 12.1. Порядок у судовій залі",
        text: "Усі присутні судового розгляду зобов'язані дотримуватися порядку та поважати судовий процес. Забороняється перешкоджати роботі суду, перебивати суддю, обвинуваченого чи свідків.",
        punishment: "Кік."
      },
      {
        title: "Стаття 12.2. Обов'язки прокурора",
        text: "Прокурор зобов'язаний сумлінно виконувати обов'язки, надавати докази, обґрунтовувати обвинувачення. Заборонено приховувати докази чи діяти в інтересах підсудного.",
        punishment: "Тимчасове відсторонення від посади або звільнення."
      },
      {
        title: "Стаття 12.3. Судові ордери",
        text: "Суд має право видавати ордери правоохоронним органам за наявності достатніх доказів або обґрунтованої підозри. Ордер є офіційним дозволом суду на проведення окремих процесуальних дій.\n\n До судових ордерів належать: ордер на арешт, ордер на обшук, ордер на проникнення до приватної власності. Ордери оформлюються та видаються через офіційного бота @Justice_HORIZON_bot.",
        punishment: "Попередження, при повтороному порушені — бан до 3 днів."
      },
      {
        title: "Стаття 12.4. Обов'язковий судовий розгляд",
        text: "Кожна особа, затримана за підозрою у вчиненні кримінального правопорушення, повинна бути доставлена до суду для розгляду справи та винесення остаточного рішення суддею.\n\n Уразі відсутності судді очікуєте 5 хвилин, після цього доставляєте затримованого в тюрму.",
        punishment: "Бан до 2 днів."
      }
    ]
  },
  {
    number: 13,
    title: "Ліцензії",
    articles: [
      {
        title: "Стаття 13.1. Ліцензії на зброю",
        text: "Ліцензія на зброю видається громадянам та працівникам правоохоронних органів і надає право законно володіти, зберігати та використовувати зброю виключно для самооборони або в інших випадках, передбачених Правилами сервера.\n\n Ліцензія на зброю (зберігання) видається виключно для законного зберігання зброї. Власник такої ліцензії має право використовувати зброю лише у випадку необхідної самооборони. Забороняється відкрито носити або демонструвати зброю в громадських місцях. \n\n Ліцензія на приховане носіння зброї видається переважно працівникам правоохоронних органів та іншим особам, визначеним адміністрацією сервера. Така ліцензія надає право приховано носити зброю під час виконання службових обов'язків або в інших випадках, передбачених Правилами сервера.",
        punishment: "скасування відповідної ліцензії на зброю."
      },
      {
        title: "Стаття 13.2. Адвокатська ліцензія",
        text: "Адвокатська ліцензія надає право представляти інтереси громадян у судових процесах. Власник ліцензії зобов'язаний дотримуватися Правил сервера, правил Судової влади України (СВУ), зберігати адвокатську таємницю та сумлінно виконувати свої професійні обов'язки.",
        punishment: "позбавлення адвокатської ліцензії до 14 днів або назавжди — залежно від тяжкості порушення."
      },
      {
        title: "Стаття 13.3. Зловживання ліцензіями",  
        text: "Забороняється використовувати будь-яку ліцензію не за її призначенням, передавати її іншим особам, використовувати для обходу Правил сервера або зловживати правами, які вона надає.",
        punishment: "анулювання відповідної ліцензії"
      }
    ]
  },
];